src/InformationRegisters/Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Диалоги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложенДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнициированКлиентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнееСообщениеОтКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяДоПервогоОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщееВремяОтветов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеВремяОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтветов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачальногоСообщенияСерии</Name>
					<Comment>Дата первого из входящих сообщений, на которые не ответил оператор</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СценарийЧатБота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииЧатБотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЭтапа</Name>
					<Comment>Заголовок или СообщениеБота</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Comment>Сообщение о коллизии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершенРегламентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Диалоги/Ext/RecordSetModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Перед записью
//
// Параметры:
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	ЭтоСценарийЧатБота = ЭтотОбъект.ДополнительныеСвойства.Свойство("СценарийЧатБота");
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если ЗначениеЗаполнено(Запись.Окончание) Тогда
			Запись.ОтложенДо					 = Неопределено;
			Запись.ПоследнееСообщениеОтКлиента	 = Ложь;
		КонецЕсли;
		
		Если ЭтоСценарийЧатБота Тогда
			
			// Перехватываем и актуализируем в регистре.
	    	Запись.СценарийЧатБота 		= ?(ЗначениеЗаполнено(Запись.СценарийЧатБота), Запись.СценарийЧатБота, 
											?(ЭтотОбъект.ДополнительныеСвойства.Свойство("СценарийЧатБота"), ЭтотОбъект.ДополнительныеСвойства.СценарийЧатБота, Запись.СценарийЧатБота));
										
			Запись.ИдентификаторЭтапа 	= ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("ИдентификаторТекущегоЭтапа"), ЭтотОбъект.ДополнительныеСвойства.ИдентификаторТекущегоЭтапа, Запись.ИдентификаторЭтапа);
			Запись.ОписаниеЭтапа 		= ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("ОписаниеЭтапа"), ЭтотОбъект.ДополнительныеСвойства.ОписаниеЭтапа, "");
			
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка = Истина
		И НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПараметрыРегистрацииТриггера") Тогда 		
		Возврат;
	КонецЕсли;	
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект[0].Окончание) Тогда
		РегламентныеЗаданияСерверСтоматология.АктуализироватьЗаданиеОчереди(Метаданные.РегламентныеЗадания.ЗакрытиеНеактивныхДиалогов);
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ПараметрыРегистрацииТриггера") Тогда	
		Для Каждого Запись Из ЭтотОбъект Цикл	
			ЭтотОбъект.ДополнительныеСвойства.ПараметрыРегистрацииТриггера.Вставить("ОбъектГенерации", Запись.ИдДиалога);
			РегистрыСведений.ЖурналРегистрацииТриггерныхСобытий.ЗарегистрироватьСобытиеТриггера(ЭтотОбъект.ДополнительныеСвойства.ПараметрыРегистрацииТриггера);
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
